## Staging: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 1 to change, 8 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.vault_scan_object.data.aws_iam_policy_document.s3_scan_object will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_scan_object" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "S3sendToSQS"

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:s3:::forms-staging-vault-file-storage",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "s3.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "LambdaTriggerFromSQS"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::806545929748:role/s3-scan-object",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.vault_scan_object.aws_cloudwatch_log_group.s3_scan_object will be destroyed
  # (because aws_cloudwatch_log_group.s3_scan_object is not in configuration)
  - resource "aws_cloudwatch_log_group" "s3_scan_object" {
      - arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/s3-scan-object-vault" -> null
      - id                = "/aws/lambda/s3-scan-object-vault" -> null
      - name              = "/aws/lambda/s3-scan-object-vault" -> null
      - retention_in_days = 7 -> null
      - tags              = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all          = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # module.vault_scan_object.aws_cloudwatch_log_metric_filter.scan_files_lambda_error[0] will be destroyed
  # (because aws_cloudwatch_log_metric_filter.scan_files_lambda_error is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "scan_files_lambda_error" {
      - id             = "S3ScanObjectLambdaErrorVault" -> null
      - log_group_name = "/aws/lambda/s3-scan-object-vault" -> null
      - name           = "S3ScanObjectLambdaErrorVault" -> null
      - pattern        = "ERROR" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "S3ScanObjectLambdaErrorVault" -> null
          - namespace  = "ScanFiles" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # module.vault_scan_object.aws_cloudwatch_metric_alarm.scan_files_api_error[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.scan_files_api_error is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "scan_files_api_error" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ] -> null
      - alarm_description         = "Errors logged by the Scan Files transport lambda function" -> null
      - alarm_name                = "S3ScanObjectLambdaErrorVault" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:S3ScanObjectLambdaErrorVault" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "S3ScanObjectLambdaErrorVault" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "S3ScanObjectLambdaErrorVault" -> null
      - namespace                 = "ScanFiles" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:687401027353:alert-ok",
        ] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # module.vault_scan_object.aws_iam_policy.s3_scan_object will be destroyed
  # (because aws_iam_policy.s3_scan_object is not in configuration)
  - resource "aws_iam_policy" "s3_scan_object" {
      - arn       = "arn:aws:iam::687401027353:policy/S3ScanObject-vault" -> null
      - id        = "arn:aws:iam::687401027353:policy/S3ScanObject-vault" -> null
      - name      = "S3ScanObject-vault" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/s3-scan-object-vault:log-stream:*",
                          - "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/s3-scan-object-vault",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA2ADCLI4MSMS2UZ5YD" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.vault_scan_object.aws_iam_role.s3_scan_object will be destroyed
  # (because aws_iam_role.s3_scan_object is not in configuration)
  - resource "aws_iam_role" "s3_scan_object" {
      - arn                   = "arn:aws:iam::687401027353:role/S3ScanObject-vault" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-07-11T13:00:23Z" -> null
      - force_detach_policies = false -> null
      - id                    = "S3ScanObject-vault" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::687401027353:policy/S3ScanObject-vault",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "S3ScanObject-vault" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA2ADCLI4MSSCUGPIVV" -> null

      - inline_policy {}
    }

  # module.vault_scan_object.aws_iam_role_policy_attachment.s3_scan_object will be destroyed
  # (because aws_iam_role_policy_attachment.s3_scan_object is not in configuration)
  - resource "aws_iam_role_policy_attachment" "s3_scan_object" {
      - id         = "S3ScanObject-vault-20220711130452409000000001" -> null
      - policy_arn = "arn:aws:iam::687401027353:policy/S3ScanObject-vault" -> null
      - role       = "S3ScanObject-vault" -> null
    }

  # module.vault_scan_object.aws_kms_alias.s3_scan_object_queue will be created
  + resource "aws_kms_alias" "s3_scan_object_queue" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/s3_scan_object_queue"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.vault_scan_object.aws_kms_key.s3_scan_object_queue will be created
  + resource "aws_kms_key" "s3_scan_object_queue" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "S3 scan objects KMS key for SQS queue encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::687401027353:root"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::806545929748:role/s3-scan-object"
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # module.vault_scan_object.aws_lambda_function.s3_scan_object will be destroyed
  # (because aws_lambda_function.s3_scan_object is not in configuration)
  - resource "aws_lambda_function" "s3_scan_object" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:687401027353:function:s3-scan-object-vault" -> null
      - filename                       = "/tmp/main.py.zip" -> null
      - function_name                  = "s3-scan-object-vault" -> null
      - handler                        = "main.handler" -> null
      - id                             = "s3-scan-object-vault" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:s3-scan-object-vault/invocations" -> null
      - last_modified                  = "2023-05-18T13:52:53.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 512 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:687401027353:function:s3-scan-object-vault:$LATEST" -> null
      - reserved_concurrent_executions = 10 -> null
      - role                           = "arn:aws:iam::687401027353:role/S3ScanObject-vault" -> null
      - runtime                        = "python3.8" -> null
      - source_code_hash               = "DHJ3p3lp/iUsdHa+AW0S5K/vLOTVNPr6e/deRtYmSFY=" -> null
      - source_code_size               = 603 -> null
      - tags                           = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - timeout                        = 120 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "ACCOUNT_ID"                  = "687401027353"
              - "S3_SCAN_OBJECT_FUNCTION_ARN" = "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object"
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.vault_scan_object.aws_lambda_permission.s3_execute will be destroyed
  # (because aws_lambda_permission.s3_execute is not in configuration)
  - resource "aws_lambda_permission" "s3_execute" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "s3-scan-object-vault" -> null
      - id            = "S3ScanObjectS3Invoke-vault" -> null
      - principal     = "s3.amazonaws.com" -> null
      - source_arn    = "arn:aws:s3:::forms-staging-vault-file-storage" -> null
      - statement_id  = "S3ScanObjectS3Invoke-vault" -> null
    }

  # module.vault_scan_object.aws_s3_bucket_notification.s3_scan_object will be updated in-place
  ~ resource "aws_s3_bucket_notification" "s3_scan_object" {
        id          = "forms-staging-vault-file-storage"
        # (2 unchanged attributes hidden)

      - lambda_function {
          - events              = [
              - "s3:ObjectCreated:*",
            ] -> null
          - id                  = "ScanObjectCreated" -> null
          - lambda_function_arn = "arn:aws:lambda:ca-central-1:687401027353:function:s3-scan-object-vault" -> null
        }

      + queue {
          + events    = [
              + "s3:ObjectCreated:*",
            ]
          + id        = "ScanObjectCreated"
          + queue_arn = (known after apply)
        }
    }

  # module.vault_scan_object.aws_sqs_queue.s3_scan_object will be created
  + resource "aws_sqs_queue" "s3_scan_object" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "s3-scan-object"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                          = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # module.vault_scan_object.aws_sqs_queue_policy.s3_scan_object will be created
  + resource "aws_sqs_queue_policy" "s3_scan_object" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

Plan: 4 to add, 1 to change, 8 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.reliability_file_storage,
  on s3.tf line 4, in resource "aws_s3_bucket" "reliability_file_storage":
   4: resource "aws_s3_bucket" "reliability_file_storage" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 17 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_2am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_3am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_5am_every_business_day"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
